In [1]:
import pandas as pd
import numpy as np

In [3]:
d={'A':[1,2,3],'B':[4,np.nan,np.nan],'C':[8,9,np.nan]}

In [4]:
df=pd.DataFrame(d)

In [5]:
df

   A    B    C
0  1  4.0  8.0
1  2  NaN  9.0
2  3  NaN  NaN

In [6]:
#REMOVES ALL THE ROWS WHICH CONTAINS NAN
df.dropna()

   A    B    C
0  1  4.0  8.0

In [7]:
#TO CHANGE THE DROPING OF ROWS TO COLUMNS WE HAVE TO PASS AND ARG 'axis=1'
df.dropna(axis=1)

   A
0  1
1  2
2  3

In [8]:
#TO REMOVE A ROW OR COL IF IT DOESNOT HAVE A MIN NUMBER OF NOT-NAN VALUES
df.dropna(thresh=2)
#HERE ROW 2 HAD ONLY 1 NON-NAN VALUE SO IT GOT DROPED

   A    B    C
0  1  4.0  8.0
1  2  NaN  9.0

In [10]:
#FILLING THE NAN FIELDS WITH ANY VALUE GIVEN
df.fillna(value='MISSING VALUE')

   A              B              C
0  1              4              8
1  2  MISSING VALUE              9
2  3  MISSING VALUE  MISSING VALUE

In [11]:
#FILLING A NAN FIELD WITH THE MEAN OF THE COLUMN
df['C'].fillna(value=df['C'].mean())

0    8.0
1    9.0
2    8.5
Name: C, dtype: float64